{"sections":{"main":{"type":"new-collection-template","blocks":{"2310c687-a728-41c8-9d82-7cc988a84b8e":{"type":"collections","settings":{"colheading":"Drinkware","coll":"custom-products-all-1"}},"af58e772-7a7d-4396-bc48-b20517da2b24":{"type":"collections","settings":{"colheading":"T shirts","coll":"custom-t-shirts-all-1"}}},"block_order":["2310c687-a728-41c8-9d82-7cc988a84b8e","af58e772-7a7d-4396-bc48-b20517da2b24"],"settings":{}},"1fd0d3dd-1498-48a7-a2bb-1ed2277a366d":{"type":"faq","blocks":{"template--14816997736484__1fd0d3dd-1498-48a7-a2bb-1ed2277a366d-168846400400bd7f80-1":{"type":"content","settings":{"title":"How much does a Customized T-shirts and Custom Tumblers cost?","answer":"<p>The price of your custom t-shirts depends on a handful of things such as the style you choose, how many custom t shirts you order, and the number of ink colors for screen printing (or thread colors for embroidery) included in your design. To make ordering as easy as possible, we've created a simple to use Quick Quote tool that allows you to quickly see your total cost prior to ever placing an order!<\/p>"}},"9517a259-ca6e-49a5-97af-0070f616a56a":{"type":"content","settings":{"title":"Where can I add a design to my custom shirts?","answer":"<p>We offer multiple design placement locations, the most common being Full Front Print, Full Back Print, and Left Chest Pockets. If your ordering more than 12 t-shirts, we also offer sleeve printing as an option!<\/p>"}},"1b9ddd4b-9981-45ea-a794-874abd71cf34":{"type":"content","settings":{"title":"What kinds of custom t shirts can I design on?","answer":"<p>Kodiak has a huge selection of t shirts to choose and customize on. Our offering includes custom t shirts for everyone from kids to adults and many specific women's styles, including long sleeve T-shirts, v-neck T-shirts, performance T-shirts, soft and fitted T-shirts, and more!<\/p>"}},"b6f91789-d09d-4e80-b9b1-8831226cb300":{"type":"content","settings":{"title":"How will my custom t shirt design be printed?","answer":"<p>Your custom t shirts order will be printed using the best method for your order’s unique needs. There are a few different ways that a custom T-shirt design can be printed. Your custom t shirt will be printed by either utilizing \"screen printing\" or DTG (also referred to as a direct to garment \"digital printing\"). If you choose embroidery, the t shirt will be customized with your logo using our state of the art embroidery equipment.<\/p>"}},"567bb1ec-9a17-4006-9971-29d06fde44da":{"type":"content","settings":{"title":"How fast can I receive my custom t shirt order?","answer":"<p>With rush shipping, we can deliver custom t shirts within 5 business days and custom embroidered t shirts within 6 business days. Our free standard shipping times for custom apparel are around 6-12 days for printed apparel and 8-14 business days for embroidered items.<\/p>"}},"f7eaa056-ac83-408a-b6a8-7aa44be11ddc":{"type":"content","settings":{"title":"How many custom t shirts do I have to order?","answer":"<p>Custom screen printed t shirts have no minimum, while embroidered t shirts do have a minimum order size of 12 items. Keep in mind that the more pieces \/ items you order, the cheaper your custom t shirts will be<\/p>"}}},"block_order":["template--14816997736484__1fd0d3dd-1498-48a7-a2bb-1ed2277a366d-168846400400bd7f80-1","9517a259-ca6e-49a5-97af-0070f616a56a","1b9ddd4b-9981-45ea-a794-874abd71cf34","b6f91789-d09d-4e80-b9b1-8831226cb300","567bb1ec-9a17-4006-9971-29d06fde44da","f7eaa056-ac83-408a-b6a8-7aa44be11ddc"],"settings":{"title":"Custom T-shirts and Drinkware FAQs"}}},"order":["main","1fd0d3dd-1498-48a7-a2bb-1ed2277a366d"]}